# Section4

In [1]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a', 'b', 'c']

In [4]:
mylist = [10, 20, 30]

In [5]:
arr = np.array(mylist)

In [6]:
arr

array([10, 20, 30])

In [7]:
d = {'a' : 10, 'b' : 20, 'c' : 30}

In [8]:
pd.Series(data=mylist)

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(arr,index=labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(data=['d','a','e'])

0     10
1      a
2    4.4
dtype: object

In [14]:
ser1 = pd.Series([1,2,3,4], index=['USA', 'Germany', 'USSR', 'Japan'])

In [16]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [19]:
ser1['USA']

1

In [20]:
ser2 = pd.Series([1,4,5,6],index=['USA', 'Germany', 'Italy', 'Japan'])

In [22]:
ser2

USA        1
Germany    4
Italy      5
Japan      6
dtype: int64

In [23]:
ser1 + ser2

Germany     6.0
Italy       NaN
Japan      10.0
USA         2.0
USSR        NaN
dtype: float64

# DataFrame - Part1

In [25]:
from numpy.random import randn
np.random.seed(101)

rand_mat = randn(5,4)

In [27]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [33]:
df = pd.DataFrame(rand_mat, index='A B C D E'.split(),  columns='W X Y Z'.split())

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df[['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [42]:
df['NEW'] = df['W'] + df['Y']

In [44]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [49]:
df.drop('NEW', axis=1, inplace=True)

In [54]:
df.drop('C')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
df.loc[['A', 'E']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [62]:
df.iloc[[0,3]]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [69]:
df.loc[['A','B']][['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965